<a href="https://colab.research.google.com/github/RafaelCaballero/BME/blob/main/c%C3%B3digo/03dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introducción a la ciencia de datos con Python
###  Rafa Caballero

## Pandas - DataFrames

Los DataFrames son la estructura principal de Pandas. Se trata de una tabla bidimensional con dos métodos de acceso fundamentales: por posición y por nombre de fila y columna.


### Índice
[Creación](#Creación)<br>
[Acceso a columnas y filas](#Acceso-a-columnas-y-filas)<br>
[Información básica](#basica)<br>
[Modificación, inserción y borrado de columnas y filas](#Modificación)<br>
[Muestras](#Samples)<br>
[Iterar](#Iterar)<br>
[Índices](#Índices)<br>

<a name="Creación"></a>
## Creación

Ya hemos visto como cargar Dataframes desde un fichero CSV o Excel.
Otra alternativa es a través de listas de listas. Esto es habitual cuando por ejemplo estamos recopilando la información mediante web scraping y la vamos acumulando en listas. En este caso habrá que indicar, además, los nombres de las columnas

In [93]:
modules = ["numpy","matplotlib","numpy","tqdm","yfinance"]

import sys
import os.path
from subprocess import check_call
import importlib
import os

def instala(modules):
    print("Instalando módulos")
    for m in modules:
        # para el import quitamos [...] y ==...
        p = m.find("[")
        mi = m if p==-1 else m[:p]
        p = mi.find("==")
        mi = mi if p==-1 else mi[:p]
        torch_loader = importlib.util.find_spec(mi)
        if torch_loader is not None:
            print(m," encontrado")
        else:
            print(m," No encontrado, instalando...",end="")  
            try:        
                r = check_call([sys.executable, "-m", "pip", "install", "--user", m])
                print("¡hecho!")
            except:
                print("¡Problema al instalar ",m,"! ¿seguro que el módulo existe?",sep="")

    print("¡Terminado!")

instala(modules)

Instalando módulos
numpy  encontrado
matplotlib  encontrado
numpy  encontrado
tqdm  encontrado
yfinance  No encontrado, instalando...¡hecho!
¡Terminado!

In [20]:
import pandas as pd

datos = [['Amadeus', 72.320], ['Santander', 	6.9700],
         ['Sabadell', 2.7590], ['BBVA',	13.265],
         ['Enagas', 14.05], ['Endesa',27.47], ['Inditex', 47.07], ['Naturgy',26.34],
         ['Repsol',11.49],['Telefónica',4.60] ]
df = pd.DataFrame(datos ,columns=['name','close'])
df

         name   close
0     Amadeus  72.320
1   Santander   6.970
2    Sabadell   2.759
3        BBVA  13.265
4      Enagas  14.050
5      Endesa  27.470
6     Inditex  47.070
7     Naturgy  26.340
8      Repsol  11.490
9  Telefónica   4.600

El siguiente resultado, quizás inesperado, debe ser fácil de entender

In [21]:

ciudades = ['Madrid', 'Barcelona', 'Valencia', 'Sevilla',
         'Alicante', 'Málaga']
habitantes = [6507184, 5609350,  2547986,  1939887,
          1838819, 1641121 ]

df2 = pd.DataFrame([ciudades,habitantes],['provincia','habitantes'])
df2

                  0          1         2        3         4        5
provincia    Madrid  Barcelona  Valencia  Sevilla  Alicante   Málaga
habitantes  6507184    5609350   2547986  1939887   1838819  1641121

También se puede crear a partir de un diccionario

In [22]:
import pandas as pd
from IPython.display import display

datos = {
    'name': ['Amadeus', 'Santander', 'Sabadell', 'BBVA', 'Enagas', 'Endesa',
             'Inditex', 'Naturgy', 'Repsol', 'Telefónica'],
    'close': [72.320, 6.9700, 2.7590, 13.265, 14.05, 27.47, 47.07, 26.34, 11.49, 4.60],
    'anterior': [71.80, 7.00, 2.80, 13.10, 14.20, 27.90, 46.50, 26.10, 11.70, 4.55]
}

df = pd.DataFrame(datos)
display(df)

         name   close  anterior
0     Amadeus  72.320     71.80
1   Santander   6.970      7.00
2    Sabadell   2.759      2.80
3        BBVA  13.265     13.10
4      Enagas  14.050     14.20
5      Endesa  27.470     27.90
6     Inditex  47.070     46.50
7     Naturgy  26.340     26.10
8      Repsol  11.490     11.70
9  Telefónica   4.600      4.55

Consideramos algunas bolsas europeas y su año de creación

LSE	Reino Unido	1801
Frankfurt	Alemania	1585
Milán	Italia	1808
Madrid	España	1831

Crear un dataframe df_bolsa con estos valores: nombre, país, año

## Acceso a columnas y filas

Al acceder a una columna obtenemos una "serie", es decir una secuencia de datos todos ellos con su etiqueta (en principio un número)

In [23]:
df['name']

0       Amadeus
1     Santander
2      Sabadell
3          BBVA
4        Enagas
5        Endesa
6       Inditex
7       Naturgy
8        Repsol
9    Telefónica
Name: name, dtype: object

Otra forma de acceder es con la notación . que solo puede usarse si el nombre de columna no contiene espacios ni símbolos especiales

In [24]:
df.name

0       Amadeus
1     Santander
2      Sabadell
3          BBVA
4        Enagas
5        Endesa
6       Inditex
7       Naturgy
8        Repsol
9    Telefónica
Name: name, dtype: object

Si queremos acceder a varias columnas a la vez usaremos una lista con una lista dentro

In [25]:
df[ ["name","anterior"] ]

         name  anterior
0     Amadeus     71.80
1   Santander      7.00
2    Sabadell      2.80
3        BBVA     13.10
4      Enagas     14.20
5      Endesa     27.90
6     Inditex     46.50
7     Naturgy     26.10
8      Repsol     11.70
9  Telefónica      4.55

**Ejercicio** En `df_bolsa` seleccionar solo el año y el país.

Veamos cuál es el tipo de una columna

In [26]:
print(type(df['name']))

<class 'pandas.core.series.Series'>

Una "Serie" representa una columna tiene 2 componentes, el índice y los valores

In [27]:
type(df.name.values), type(df.name.index)

(numpy.ndarray, pandas.core.indexes.range.RangeIndex)

In [28]:
df.name.index

RangeIndex(start=0, stop=10, step=1)

In [29]:
list(df.name.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

En un *dataframe* tenemos 3 compones: columnas (X), índice (y), valores

Se puede acceder a las columnas, a los índices y a los valores por separado

In [30]:
df.columns

Index(['name', 'close', 'anterior'], dtype='object')

In [31]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [32]:
df.values

array([['Amadeus', 72.32, 71.8],
       ['Santander', 6.97, 7.0],
       ['Sabadell', 2.759, 2.8],
       ['BBVA', 13.265, 13.1],
       ['Enagas', 14.05, 14.2],
       ['Endesa', 27.47, 27.9],
       ['Inditex', 47.07, 46.5],
       ['Naturgy', 26.34, 26.1],
       ['Repsol', 11.49, 11.7],
       ['Telefónica', 4.6, 4.55]], dtype=object)

#### Acceso por posición

Sin embargo, no podemos acceder a la fila por posición directamente:

In [33]:
# esto daría error
# df[0]

Sí podríamos usar df.values, que nos da todas las filas, aunque no es muy habitual

In [34]:
df.values[0]

array(['Amadeus', 72.32, 71.8], dtype=object)

En lugar de eso, utilizaremos `iloc` que recibe un entero como parámetro para acceder a la fila

In [35]:
df.iloc[0]

name        Amadeus
close         72.32
anterior       71.8
Name: 0, dtype: object

**Ejercicio 1**

Acceder a las 3 primeras filas. Pista: utilizar iloc y la misma notación que si fuera una lista

Igualmente dentro de la fila  podemos acceder a la columna por posición

In [36]:
df.iloc[0][0], df.iloc[0][1]

C:\Users\sames\AppData\Local\Temp\ipykernel_18076\956240467.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0], df.iloc[0][1]

('Amadeus', np.float64(72.32))

Otra forma de lograr lo mismo [fila,columna]

In [37]:
df.iloc[0,0], df.iloc[0,1]

('Amadeus', np.float64(72.32))

**Ejercicio 2** Seleccionar las filas de la 2 a la 4, ambas incluidas (comenzando en 0) y solo la primera columna (la número 0)

In [38]:
# solución

**Acceso por índice.**

A menudo el índice es la posición sin más, con lo que la función iloc nos sirve. Sin embargo esto no es siempre así

In [39]:
import pandas as pd
datos = [['Madrid', 7058041], ['Barcelona', 5924293],
         ['Valencia', 2730314], ['Alicante', 2008809],
         ['Sevilla', 1969075], ['Málaga',1778275], ['Murcia', 1575171], ['Cádiz',1258881],
         ['Illes Balears',1238812],['Las Palmas',1164130] ]
df = pd.DataFrame(datos ,columns=['provincia','habitantes'],
               index=['Capital','Capital Com. Autonoma','Capital Com. Autonoma','provincia',
                      'Capital Com. Autonoma','Provincia','Capital Com. Autonoma',
                      'Provincia','Provincia','Provincia'])
df

                           provincia  habitantes
Capital                       Madrid     7058041
Capital Com. Autonoma      Barcelona     5924293
Capital Com. Autonoma       Valencia     2730314
provincia                   Alicante     2008809
Capital Com. Autonoma        Sevilla     1969075
Provincia                     Málaga     1778275
Capital Com. Autonoma         Murcia     1575171
Provincia                      Cádiz     1258881
Provincia              Illes Balears     1238812
Provincia                 Las Palmas     1164130

Vemos que iloc en este caso no vale

In [40]:
# error
#df.iloc['Capital']

Si se quiere acceder por el índice se puede usar `loc`

In [41]:
df.loc['Capital']

provincia      Madrid
habitantes    7058041
Name: Capital, dtype: object

In [42]:
df.loc['Provincia']

               provincia  habitantes
Provincia         Málaga     1778275
Provincia          Cádiz     1258881
Provincia  Illes Balears     1238812
Provincia     Las Palmas     1164130

Si se quiere acceder por nombre de fila y columna podemos hacerlo seleccionando primero la fila:

In [43]:
df.loc['Provincia']["habitantes"]

Provincia    1778275
Provincia    1258881
Provincia    1238812
Provincia    1164130
Name: habitantes, dtype: int64

O utilizar `loc`con la notación habitual fila, columna

In [44]:
df.loc['Provincia','habitantes']

Provincia    1778275
Provincia    1258881
Provincia    1238812
Provincia    1164130
Name: habitantes, dtype: int64

<a name="basica"></a>
## Información básica

Con poco esfuerzo podemos tener mucha información interesante sobre los datos. Veamos el siguiente ejemplo con datos de los "Pokemon"

In [47]:
import pandas as pd
url = "https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/pokemon.csv"
df = pd.read_csv(url)
df

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

Nombres de las columnas:

In [48]:
df.columns

Index(['#', 'Name', 'Type 1', 'Type 2', 'HP', 'Attack', 'Defense', 'Sp. Atk',
       'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

Si queremos saber el número de filas y columnas podemos usar `shape`

In [49]:
df.shape

(800, 12)

Es una tupla: podemos separar las dos componentes fácilmente

In [50]:
(f,c) = df.shape

print(f"Datataframe con {f} filas y {c} columnas")

Datataframe con 800 filas y 12 columnas

In [51]:
# otra forma, aprovechando que las tuplas son secuencias
s = df.shape

print(f"Datataframe con {s[0]} filas y {s[1]} columnas")

Datataframe con 800 filas y 12 columnas

Más formas aun...

In [52]:
f = len(df)
c = len(df.columns)
print(f"Datataframe con {f} filas y {c} columnas")

Datataframe con 800 filas y 12 columnas

Datos básicos sobre el dataframe completo con `info` y estadísticas básicas sobre las columnas  numéricas con `describe`

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   HP          800 non-null    int64
 5   Attack      800 non-null    int64
 6   Defense     800 non-null    int64
 7   Sp. Atk     800 non-null    int64
 8   Sp. Def     800 non-null    int64
 9   Speed       800 non-null    int64
 10  Generation  800 non-null    int64
 11  Legendary   800 non-null    bool
dtypes: bool(1), int64(8), object(3)
memory usage: 69.7+ KB

In [54]:
df.describe()

,#,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
count,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.00000
mean,362.813750,69.258750,79.001250,73.842500,72.820000,71.902500,68.277500,3.32375
std,208.343798,25.534669,32.457366,31.183501,32.722294,27.828916,29.060474,1.66129
min,1.000000,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000,1.00000
25%,184.750000,50.000000,55.000000,50.000000,49.750000,50.000000,45.000000,2.00000
50%,364.500000,65.000000,75.000000,70.000000,65.000000,70.000000,65.000000,3.00000
75%,539.250000,80.000000,100.000000,90.000000,95.000000,90.000000,90.000000,5.00000
max,721.000000,255.000000,190.000000,230.000000,194.000000,230.000000,180.000000,6.00000

A menudo nos puede interesar saber qué valores diferentes toma una columna

In [55]:
df["Type 1"].unique()

array(['Grass', 'Fire', 'Water', 'Bug', 'Normal', 'Poison', 'Electric',
       'Ground', 'Fairy', 'Fighting', 'Psychic', 'Rock', 'Ghost', 'Ice',
       'Dragon', 'Dark', 'Steel', 'Flying'], dtype=object)

In [56]:
len(df["Type 1"].unique())

18

También nos puede interesar saber ccuántos pokemon de cada tipo hay:

In [57]:
df["Type 1"].value_counts()

Type 1
Water       112
Normal       98
Grass        70
Bug          69
Psychic      57
Fire         52
Rock         44
Electric     44
Ground       32
Ghost        32
Dragon       32
Dark         31
Poison       28
Fighting     27
Steel        27
Ice          24
Fairy        17
Flying        4
Name: count, dtype: int64

In [58]:
s = df["Type 1"].value_counts()
s.index

Index(['Water', 'Normal', 'Grass', 'Bug', 'Psychic', 'Fire', 'Rock',
       'Electric', 'Ground', 'Ghost', 'Dragon', 'Dark', 'Poison', 'Fighting',
       'Steel', 'Ice', 'Fairy', 'Flying'],
      dtype='object', name='Type 1')

In [59]:
s.values

array([112,  98,  70,  69,  57,  52,  44,  44,  32,  32,  32,  31,  28,
        27,  27,  24,  17,   4])

**Ejercicio** Tipo de Pokemon más común en Type 1 y número de veces que aparece

In [60]:
frecuencias = df["Type 1"].value_counts()
frecuencias.index[0], frecuencias.values[0]

('Water', np.int64(112))

<a name="Modificación"></a>
## Modificación, inserción y borrado de columnas y filas

**Ejercicio 3** ¿Qué hace el siguiente código?

In [61]:
datos = [['Madrid', 6507184], ['Barcelona', 5609350],
         ['Valencia', 2547986], ['Sevilla', 1939887],
         ['Alicante', 1838819], ['Málaga',1641121]  ]
df = pd.DataFrame(datos ,columns=['provincias','habitantes'],
               index=['a','b','c','d','e','f'])

df.iloc[1] = 0
df

  provincias  habitantes
a     Madrid     6507184
b          0           0
c   Valencia     2547986
d    Sevilla     1939887
e   Alicante     1838819
f     Málaga     1641121

**Ejercicio 4** ¿Qué hace el siguiente código?

In [62]:
df['superficie'] = 0
df

  provincias  habitantes  superficie
a     Madrid     6507184           0
b          0           0           0
c   Valencia     2547986           0
d    Sevilla     1939887           0
e   Alicante     1838819           0
f     Málaga     1641121           0

Por tanto para crear una columna nos basta con "rellenarla" del valor que se desee. Luego veremos casos más complejos.

### Eliminar filas y columnas
Una forma de eliminar columnas es seleccionar solo las que se quieren mantener. Primero preparamos los datos.

In [63]:
datos = {'provincia' : ['Madrid', 'Barcelona', 'Valencia', 'Sevilla',
         'Alicante', 'Málaga'],
         'habitantes' : [6507184, 5609350,  2547986,  1939887,
          1838819, 1641121 ]}
df = pd.DataFrame(datos)
df["superficie"] = 0
df

   provincia  habitantes  superficie
0     Madrid     6507184           0
1  Barcelona     5609350           0
2   Valencia     2547986           0
3    Sevilla     1939887           0
4   Alicante     1838819           0
5     Málaga     1641121           0

In [64]:
df2 = df.loc[ : , ['superficie'] ]  # todas las filas, columna solo superficie
df2

   superficie
0           0
1           0
2           0
3           0
4           0
5           0

Equivalente a

In [65]:
df2 = df[["superficie"]]
df2

   superficie
0           0
1           0
2           0
3           0
4           0
5           0

**Pregunta** ¿También es equivalente a `df["superficie"]`?

Varias columnas

In [66]:
df2 = df[['provincia', 'superficie'] ]
df2

   provincia  superficie
0     Madrid           0
1  Barcelona           0
2   Valencia           0
3    Sevilla           0
4   Alicante           0
5     Málaga           0

En general para borrar filas o columnas por nombre usaremos [drop](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html). El parámetro `axis`indica si queremos borrar filas (0) o columnas (1)

In [67]:
datos = {'provincia' : ['Madrid', 'Barcelona', 'Valencia', 'Sevilla',
         'Alicante', 'Málaga'],
         'habitantes' : [6507184, 5609350,  2547986,  1939887,
          1838819, 1641121 ]}
df = pd.DataFrame(datos)
df["superficie"] = 0
df

   provincia  habitantes  superficie
0     Madrid     6507184           0
1  Barcelona     5609350           0
2   Valencia     2547986           0
3    Sevilla     1939887           0
4   Alicante     1838819           0
5     Málaga     1641121           0

In [68]:
dfSinFila = df.drop([3,5],axis=0)
dfSinFila

   provincia  habitantes  superficie
0     Madrid     6507184           0
1  Barcelona     5609350           0
2   Valencia     2547986           0
4   Alicante     1838819           0

In [69]:
dfSinCol = df.drop(['superficie'],axis=1)
dfSinCol

   provincia  habitantes
0     Madrid     6507184
1  Barcelona     5609350
2   Valencia     2547986
3    Sevilla     1939887
4   Alicante     1838819
5     Málaga     1641121

Si queremos podemos eviar el uso de axis utilizando los parámetros `index` y `columns`

In [70]:
datos = {'provincia' : ['Madrid', 'Barcelona', 'Valencia', 'Sevilla',
         'Alicante', 'Málaga'],
         'habitantes' : [6507184, 5609350,  2547986,  1939887,
          1838819, 1641121 ]}
df = pd.DataFrame(datos)
df["superficie"] = 0
df

   provincia  habitantes  superficie
0     Madrid     6507184           0
1  Barcelona     5609350           0
2   Valencia     2547986           0
3    Sevilla     1939887           0
4   Alicante     1838819           0
5     Málaga     1641121           0

In [71]:
df.drop(index=[1,3])

  provincia  habitantes  superficie
0    Madrid     6507184           0
2  Valencia     2547986           0
4  Alicante     1838819           0
5    Málaga     1641121           0

In [72]:
df.drop(columns=['provincia'])

   habitantes  superficie
0     6507184           0
1     5609350           0
2     2547986           0
3     1939887           0
4     1838819           0
5     1641121           0

Las columnas también se puede eliminar con `del` como en los diccionarios

In [73]:
if 'superficie' in df2:
    del df2['superficie']
df2

   provincia
0     Madrid
1  Barcelona
2   Valencia
3    Sevilla
4   Alicante
5     Málaga

Una variante interesante es `pop`, que borra una fila y la devuelve

In [74]:
df2 = df.copy()
habi = df2.pop("habitantes")
df2

   provincia  superficie
0     Madrid           0
1  Barcelona           0
2   Valencia           0
3    Sevilla           0
4   Alicante           0
5     Málaga           0

In [75]:
habi

0    6507184
1    5609350
2    2547986
3    1939887
4    1838819
5    1641121
Name: habitantes, dtype: int64

In [76]:
df

   provincia  habitantes  superficie
0     Madrid     6507184           0
1  Barcelona     5609350           0
2   Valencia     2547986           0
3    Sevilla     1939887           0
4   Alicante     1838819           0
5     Málaga     1641121           0

Veamos un ejemplo con valores del IBEX

In [101]:
import yfinance as yf
import pandas as pd

# Diccionario: nombre -> ticker de Yahoo Finance
tickers = {
    'Amadeus': 'AMS.MC',
    'Santander': 'SAN.MC',
    'Sabadell': 'SAB.MC',
    'BBVA': 'BBVA.MC',
    'Enagas': 'ENG.MC',
    'Endesa': 'ELE.MC',
    'Inditex': 'ITX.MC',
    'Naturgy': 'NTGY.MC',
    'Repsol': 'REP.MC',
    'Telefónica': 'TEF.MC'
}

# Descarga los datos (últimos 30 días por defecto)
df_ibex = yf.download(list(tickers.values()), progress=False)



# Muestra las 5 primeras filas
df_ibex.head()

Price       Close                                                        \
Ticker     AMS.MC   BBVA.MC    ELE.MC ENG.MC ITX.MC   NTGY.MC    REP.MC
Date
2000-01-03    NaN  4.115111 -4.093285    NaN    NaN  5.771164  6.023073
2000-01-04    NaN  4.007735 -3.983471    NaN    NaN  5.631790  5.820847
2000-01-05    NaN  3.917771 -4.013615    NaN    NaN  5.371105  5.741596
2000-01-06    NaN  3.917771 -4.013615    NaN    NaN  5.371105  5.741596
2000-01-07    NaN  3.967106 -4.157880    NaN    NaN  5.758260  5.921960

Price                                     ... Volume                     \
Ticker        SAB.MC    SAN.MC    TEF.MC  ... AMS.MC   BBVA.MC   ELE.MC
Date                                      ...
2000-01-03  1.148128  2.659120  7.062278  ...    NaN   8244257  3615680
2000-01-04  1.148128  2.596029  6.771314  ...    NaN   8522096  4048543
2000-01-05  1.148128  2.532939  6.454920  ...    NaN  12159826  4688995
2000-01-06  1.148128  2.532939  6.454920  ...    NaN         0        0
2000-01-07  1.148128  2.645098  6.466221  ...    NaN  62261944  4027102

Price
Ticker     ENG.MC ITX.MC  NTGY.MC   REP.MC SAB.MC   SAN.MC    TEF.MC
Date
2000-01-03    NaN    NaN  1665096  3215655   7949  8797337  13579848
2000-01-04    NaN    NaN  1995656  3244446   3178  8811013  15091975
2000-01-05    NaN    NaN  1441158  3235272   3974  9333517  16630986
2000-01-06    NaN    NaN        0        0      0        0         0
2000-01-07    NaN    NaN  2313006  5914766   2652  9603132  17595592

[5 rows x 50 columns]

In [102]:
df_ibex.columns

MultiIndex([( 'Close',  'AMS.MC'),
            ( 'Close', 'BBVA.MC'),
            ( 'Close',  'ELE.MC'),
            ( 'Close',  'ENG.MC'),
            ( 'Close',  'ITX.MC'),
            ( 'Close', 'NTGY.MC'),
            ( 'Close',  'REP.MC'),
            ( 'Close',  'SAB.MC'),
            ( 'Close',  'SAN.MC'),
            ( 'Close',  'TEF.MC'),
            (  'High',  'AMS.MC'),
            (  'High', 'BBVA.MC'),
            (  'High',  'ELE.MC'),
            (  'High',  'ENG.MC'),
            (  'High',  'ITX.MC'),
            (  'High', 'NTGY.MC'),
            (  'High',  'REP.MC'),
            (  'High',  'SAB.MC'),
            (  'High',  'SAN.MC'),
            (  'High',  'TEF.MC'),
            (   'Low',  'AMS.MC'),
            (   'Low', 'BBVA.MC'),
            (   'Low',  'ELE.MC'),
            (   'Low',  'ENG.MC'),
            (   'Low',  'ITX.MC'),
            (   'Low', 'NTGY.MC'),
            (   'Low',  'REP.MC'),
            (   'Low',  'SAB.MC'),
            (   'Low',  'SAN.MC'),
            (   'Low',  'TEF.MC'),
            (  'Open',  'AMS.MC'),
            (  'Open', 'BBVA.MC'),
            (  'Open',  'ELE.MC'),
            (  'Open',  'ENG.MC'),
            (  'Open',  'ITX.MC'),
            (  'Open', 'NTGY.MC'),
            (  'Open',  'REP.MC'),
            (  'Open',  'SAB.MC'),
            (  'Open',  'SAN.MC'),
            (  'Open',  'TEF.MC'),
            ('Volume',  'AMS.MC'),
            ('Volume', 'BBVA.MC'),
            ('Volume',  'ELE.MC'),
            ('Volume',  'ENG.MC'),
            ('Volume',  'ITX.MC'),
            ('Volume', 'NTGY.MC'),
            ('Volume',  'REP.MC'),
            ('Volume',  'SAB.MC'),
            ('Volume',  'SAN.MC'),
            ('Volume',  'TEF.MC')],
           names=['Price', 'Ticker'])

Esto es un índice jerárquico...cada columna tiene columnas dentro. Lo mejor es proceder paso a paso

In [104]:
df_close = df_ibex["Close"]
df_close

Ticker,AMS.MC,BBVA.MC,ELE.MC,ENG.MC,ITX.MC,NTGY.MC,REP.MC,SAB.MC,SAN.MC,TEF.MC
Date,,,,,,,,,,
2000-01-03,NaN,4.115111,-4.093285,NaN,NaN,5.771164,6.023073,1.148128,2.659120,7.062278
2000-01-04,NaN,4.007735,-3.983471,NaN,NaN,5.631790,5.820847,1.148128,2.596029,6.771314
2000-01-05,NaN,3.917771,-4.013615,NaN,NaN,5.371105,5.741596,1.148128,2.532939,6.454920
2000-01-06,NaN,3.917771,-4.013615,NaN,NaN,5.371105,5.741596,1.148128,2.532939,6.454920
2000-01-07,NaN,3.967106,-4.157880,NaN,NaN,5.758260,5.921960,1.148128,2.645098,6.466221
...,...,...,...,...,...,...,...,...,...,...
2025-05-19,72.620003,13.465000,26.510000,13.490,48.500000,26.219999,11.715000,2.770000,6.943000,4.496000
2025-05-20,73.480003,13.770000,27.150000,13.660,48.450001,26.500000,11.810000,2.825000,7.044000,4.550000
2025-05-21,73.680000,13.695000,27.260000,13.810,48.570000,26.500000,11.755000,2.786000,7.036000,4.571000
2025-05-22,73.099998,13.680000,27.370001,13.835,48.230000,26.459999,11.600000,2.822000,7.074000,4.607000
2025-05-23,72.320000,13.265000,27.469999,14.050,47.070000,26.340000,11.495000,2.759000,6.970000,4.606000

In [105]:
df_close["BBVA.MC"]

Date
2000-01-03     4.115111
2000-01-04     4.007735
2000-01-05     3.917771
2000-01-06     3.917771
2000-01-07     3.967106
                ...
2025-05-19    13.465000
2025-05-20    13.770000
2025-05-21    13.695000
2025-05-22    13.680000
2025-05-23    13.265000
Name: BBVA.MC, Length: 6520, dtype: float64

### Filtros

Para *filtrar* filas lo normal es escribir una expresión booleana que solo cumplan las filas que queremos y acceder mediante este filtro

In [77]:
datos = [['Madrid', 6507184], ['Barcelona', 5609350],
         ['Valencia', 2547986], ['Sevilla', 1939887],
         ['Alicante', 1838819], ['Málaga',1694089]  ]
df = pd.DataFrame(datos ,columns=['ciudades','habitantes'],
               index=['Capital','Capital Com. Autonoma','Capital Com. Autonoma','Ciudad','Ciudad','Ciudad'])

df

                        ciudades  habitantes
Capital                   Madrid     6507184
Capital Com. Autonoma  Barcelona     5609350
Capital Com. Autonoma   Valencia     2547986
Ciudad                   Sevilla     1939887
Ciudad                  Alicante     1838819
Ciudad                    Málaga     1694089

Ciudades con más de 200000 habitantes

In [78]:
filtro = df.habitantes > 2000000
df2 = df[filtro]
df2

                        ciudades  habitantes
Capital                   Madrid     6507184
Capital Com. Autonoma  Barcelona     5609350
Capital Com. Autonoma   Valencia     2547986

Esto es importante pero bastante complejo. Para entenderlo veamos primero el filtro

In [79]:
filtro

Capital                   True
Capital Com. Autonoma     True
Capital Com. Autonoma     True
Ciudad                   False
Ciudad                   False
Ciudad                   False
Name: habitantes, dtype: bool

Aquí el índice no es importante, lo importante es que hay un True en cada fila que cumple la condición y un false en la que no.

Y Python permite usar una secuencia de Trues y False para acceder a elementos, devolviendo solo en los que hay Trues; por eso df[filtro] es equivalente a

In [80]:
df[[True,True,True,False,False,False]]

                        ciudades  habitantes
Capital                   Madrid     6507184
Capital Com. Autonoma  Barcelona     5609350
Capital Com. Autonoma   Valencia     2547986

**Ejemplo** La función de strings `startswith` indica si un string empieza por una letra

In [81]:
s = "Barcerlona"
print(s.startswith("B"))
print(s.startswith("V"))

True
False

vamos a usarla para quedarnos solo con las ciudades que empiezan por M

In [82]:
filtro = df.ciudades.str.startswith("M")  # ciudades cuyo nombre empieza por M

df2 = df[filtro]
df2

        ciudades  habitantes
Capital   Madrid     6507184
Ciudad    Málaga     1694089

In [83]:
filtro

Capital                   True
Capital Com. Autonoma    False
Capital Com. Autonoma    False
Ciudad                   False
Ciudad                   False
Ciudad                    True
Name: ciudades, dtype: bool

**Detalle**: Fijarse en el df.ciudades**.str**.startswith("M"). Es necesario porque al ser `startswith` una función que solo vale para strings tenemos que "avisar" a Python de que la función es de tipo string, cuando por defecto las considera numéricas. Además de *str* existe otro para indicar que la columna es una fecha, *dt*.

Si lo que queremos es saber cuántos elementos cumplen el filtro, nos basta con recordar que los Trues se corresponden con 1s, y los Falses con 0s.

In [84]:
sum(filtro)

2

**Ejercicio 4**

a) Cargar el fichero "https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/parocomunidades.csv" que está con codificación (`encoding`) "latin1" y dejarlo en un dataframe `df_paro`

In [85]:
import pandas as pd
url = "https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/parocomunidades.csv"

b) Mostrar solo las filas de `df_paro` que corresponden al Periodo 2019

c) Mostrar solo las filas de `df_paro` que corresponden a un total mayor de 15

d) (más difícil) Mostrar solo las filas que corresponden al Periodo 2019 y tienen Total mayor de 15

**Nota** Para combinar varias condiciones en un filtro se utilizan los operadores de bit: `&` en lugar de `and`, `|` en lugar de `or` y `~` en lugar de not.

**Ejemplo**

Queremos todos los datos de `df_paro` salvo los de Andalucía

In [91]:
# método 1
import pandas as pd
url = "https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/parocomunidades.csv"
df_paro = pd.read_csv(url, encoding="latin1")
filtro = df_paro["Comunidad"]!="Andalucía"
df_paro[filtro]

      Comunidad  Periodo  Total
0     Andalucía     2023  18.67
1     Andalucía     2022  19.00
2     Andalucía     2021  20.18
3     Andalucía     2020  22.74
4     Andalucía     2019  20.80
..          ...      ...    ...
413     Melilla     2006   9.86
414     Melilla     2005  12.33
415     Melilla     2004  12.49
416     Melilla     2003  19.88
417     Melilla     2002   3.57

[418 rows x 3 columns]

In [ ]:
# método 2, más raro
filtro = df_paro["Comunidad"]=="Andalucía"
df_paro[~filtro]

**Ejercicio 5** Consideramos este DataFrame

In [ ]:
data = [[1,2,3,4,5,6,7],
        [1,2,0,0,0,6,7],
        [1,2,0,0,0,6,7],
        [1,2,0,0,0,6,7],
        [1,2,3,4,5,6,7],
       ]
df = pd.DataFrame(data)
df

Encontrar una expresión de cambiar todos los 0s por 9s (hay varias formas, alguna utilizando posiciones y alguna otra sin posiciones)

### Añadir filas

Veamos como [añadir filas](https://www.stackvidhya.com/add-row-to-dataframe/#:~:text=You%20can%20add%20rows%20to,append()) a un dataframe ya existente con append

In [ ]:
datos = [['Madrid', 6507184], ['Barcelona', 5609350],
         ['Valencia', 2547986], ['Sevilla', 1939887],
         ['Alicante', 1838819], ['Málaga',1694089]  ]
df = pd.DataFrame(datos ,columns=['ciudades','habitantes'])
df

In [ ]:
df = df.append( {'ciudades':'Cáceres', 'habitantes': 394151 }, ignore_index = True)
df

Ahora añadimos una columna con la superficie

In [ ]:
df["superficie"] = [8027, 7773, 10807,14036,5817,7306, 19868]
df

Y obtenemos la densidad:

In [ ]:
df["densidad"] = df["habitantes"]/df["superficie"]
df

### Ordenar

Para ordenar utilizaremos `sort_values`

In [ ]:
datos = [['Madrid', 6507184], ['Barcelona', 5609350],
         ['Valencia', 2547986], ['Sevilla', 1939887],
         ['Alicante', 1838819], ['Málaga',1694089]  ]
df = pd.DataFrame(datos ,columns=['provincia','habitantes'])
df_ordenado = df.sort_values(by='provincia', ascending=True)
df_ordenado

Ordenar por dos columnas

In [ ]:
datos = [['Bertoldo', 'Cacaseno'], ['Aniceto', 'Cacaseno'],
         ['Herminia', 'Ducasse'], ['Calixta', 'Albrich'] ]
df = pd.DataFrame(datos ,columns=['nombre','apellido'])
df.sort_values(by='apellido',ascending=True)

In [ ]:
df.sort_values(by=['apellido','nombre'],ascending=True)

<a name="Samples"></a>
## Muestras

En ocasiones nos interesará tomar muestras de un dataset muy grande para tener unos pocos datos manejables y representativos

Las muestras también se utilizarán en nuestros experimentos con datos, dividiendo el conjunto en dos:

- Entrenamiento

- Test

El conjunto de entrenamiento lo usaremos para nuestras hipótesis, nuestros modelos. Una vez realizado el modelo lo probaremos con datos "nuevos" los datos de test

En ambos casos utilizaremos [sample](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sample.html) al que se puede pasar la proporción de datos a obtener o el número de valores a obtener

In [ ]:
# lectura de un fichero en panda
import pandas as pd

url = "https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/madpollution_output.csv"
df = pd.read_csv(url)
df

In [ ]:
# solo queremos 100 filas al azar
df.sample(n=100)

Ejemplo de división de un dataframe en dos de forma aleatoria

In [ ]:
train_dataset = df.sample(frac=0.8,random_state=0)
test_dataset = df.drop(train_dataset.index)
print(len(train_dataset), len(test_dataset))

También se pueden tomar muestras con reemplazamiento, lo que significa que se puede repetir

In [ ]:
datos = [['Bertoldo', 'Cacaseno'], ['Aniceto', 'Cacaseno'],
         ['Herminia', 'Ducasse'], ['Calixta', 'Albrich'] ]
df = pd.DataFrame(datos ,columns=['nombre','apellido'])
df

In [ ]:
df.sample(n=10,replace=True)

<a name="Iterar"></a>
## Iterar

Intentaremos evitar iterar por el dataframe con un `for`, pero a veces no hay más remedio. En ese caso usaremos `iterrows`
 que nos devuelve cada fila como un array con dos posiciones, la 0 para el índice y la 1 para la fila en sí

In [ ]:
import pandas as pd
file = "https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/top10s.csv"
df = pd.read_csv(file,encoding="latin-1", index_col=0)
df

In [ ]:
for row in df.iterrows():
    print(row[1]["title"])

**Ejemplo 11** Utilizar iterrows para encontrar el título de la canción  con más bpm.

Idea: usar una variable bpm que lleve el máximo hasta el momento y otra título con el título del máximo hasta el momento, e ir actualizando ambas variables

In [ ]:
## Y ahora sin iterrows...

## Índices

Ya hemos visto unas cuantas cosas sobre los índices

- Se usan para referenciar fila
- Se puede acceder con loc
- Hay índices de tipos diversos

Algunas cosas nuevas:

In [ ]:
import pandas as pd
import numpy as np
data = [[1,2,3,4,5,6,7],
        [1,2,0,0,0,6,7],
        [1,2,0,0,0,6,7],
        [1,2,0,0,0,6,7],
        [1,2,3,4,5,6,7],
       ]
df1 = pd.DataFrame(data, columns=[chr(ord('a')+i) for i in range(len(data[0]))],
               index = ['i'+chr(ord('a')+i) for i in range(len(data))])
df2 = pd.DataFrame(data, columns=[chr(ord('a')+i) for i in range(len(data[0]))],
               index = [i-1 for i in range(len(data),0,-1)])
df3 = pd.DataFrame(data, columns=[chr(ord('a')+i) for i in range(len(data[0]))],
               index = [np.random.randint(3) for i in range(len(data),0,-1)])

In [ ]:
print(df1,df2,df3,sep="\n")

Se puede comprobar si es monótono creciente.

> Indented block

In [ ]:
df1.index.is_monotonic, df2.index.is_monotonic, df3.index.is_monotonic

También de si hay valores repetidos

In [ ]:
df1.index.is_unique, df2.index.is_unique, df3.index.is_unique

En caso de que no sea único podemos querer obtener los valores distintos

In [ ]:
df3.index.unique()

Una de las operaciones más básicas, que haremos a menudo es reindexar:

In [ ]:

df4 = df2.reindex([1,2,3,4,5])
df4

- ¿Por qué necesitamos hacer df4 y no queda modificado df2? Porque los índices son inmutables. Para que se cambie en el propio DataFram usar el argumento `inplace=True`

- ¿Por qué aparecen los NaN? (pensar...)

In [ ]:
df4 = df2.reindex([1,2,3,4,5],fill_value=0)
df4

También vale para columnas

In [ ]:
df4 = df2.reindex(columns=[1,2,3,4,5],fill_value=-1)
df4

Esto es un poco desastre. ¿No podemos solo cambiar los índices sin cargarnos todo? La solución es `reset_index()`

In [ ]:
df2 = pd.DataFrame(data, columns=[chr(ord('a')+i) for i in range(len(data[0]))],
               index = [i-1 for i in range(len(data),0,-1)])
df2

In [ ]:
df2.reset_index(inplace=True)
df2

El índice se 'guarda' en una columna `index`. Se puede evitar utilizando `drop=True`

In [ ]:
from pandas import DataFrame
data = [[1,2,3,4,5,6,7],
        [1,2,0,0,0,6,7],
        [1,2,0,0,0,6,7],
        [1,2,0,0,0,6,7],
        [1,2,3,4,5,6,7],
       ]
df2 = DataFrame(data, columns=[chr(ord('a')+i) for i in range(len(data[0]))],
               index = [i-1 for i in range(len(data),0,-1)])
df2.reset_index(drop=True, inplace=True)
df2

Si no se quiere que el índice empiece en 0, ni tampoco que se pierda información, se puede acceder directamente a .index o a .columns

In [ ]:
df2.index = ['a','b','c','d','e']
df2

In [ ]:
df2[df2.index=='a']

In [ ]:
df2.loc['a']

Si se accede directamente a `index` se deben poner tantos elementos como filas hay, si no se obtendrá un error

In [ ]:
# esto daría error
#df2.index = ['a','b','c','d']

**Ej.** Queremos sumar dos series:

In [ ]:
a = pd.Series([1,2,3,4],['a','b','c','d'])
b = pd.Series([1,2,3,4],[10,20,30,40])

Sin embargo:

In [ ]:
a+b

¿qué podemos hacer?

In [ ]:
a.reset_index(drop=True)+b.reset_index(drop=True)

Se pueden eliminar filas a partir del índice con drop()

In [ ]:
c = a.reset_index(drop=True)+b.reset_index(drop=True)
print(c,type(c))
d = c.drop([1,2])
print(d)

In [ ]:
df = DataFrame(np.arange(16).reshape((4, 4)),
               columns=['c'+str(i) for i in range(4)],
               index = ['f'+str(i) for i in range(4)])
df

In [ ]:
df.drop(['c1','c2'],axis=1,inplace=True)
df

In [ ]:
df = DataFrame(np.arange(16).reshape((4, 4)),
               columns=['c'+str(i) for i in range(4)],
               index = ['f'+str(i) for i in range(4)])
df.drop(['f1','f2'],axis=0,inplace=True)
df

Como ya hemos visto las operaciones aritméticas utilizan los índices comunes. Esto vale tanto para filas como para columnas

In [ ]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

print(df1)
print(df2)

In [ ]:
df1+df2

Para evitarlo se puede añadir 0 para evitar el valor `NaN`

In [ ]:
df1.add(df2,fill_value=0)

Análogamente existen funciones `add`, `sub`, `div`, `mul`

La siguiente operación ya no debe sorprendernos:

In [ ]:
f = df1.loc[1,:]
print(df1,"\n",f,"\n",df1-f,sep="")

Si lo que queremos es restar sobre las columnas

In [ ]:
f.index = range(len(f))
df1.sub(f,axis=0)

Si lo que se quiere es ordenar los índices, no cambiarlo, se puede utilizar `sort_index()`

In [ ]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)),
                columns=list('dfab'),index=list('431'))
df1

In [ ]:
df1.sort_index(inplace=True)
df1